# 刘启迪 - 个人简历
## 基本信息
- **求职意向**：算力平台开发工程师（北京，29-35K，一个月内到岗）
- **出生年月**：1997-11
- **性别**：男
- **政治面貌**：中共党员
- **工作年限**：5年经验
- **电话**：13898941437
- **邮箱**：Lqd54766209@163.com

## 个人介绍
本人从事开发5年，具备扎实的计算机基础与系统化思维，对云计算与人工智能(AI)的融合领域充满热情。拥有大数据处理、后端开发及AI云原生开发经验，熟悉分布式系统设计和高并发场景优化。技术栈上，熟练掌握Java和Golang，能够高效构建稳定可靠的后端服务，并在云原生环境下实现AI模型的部署。致力于通过技术创新推动智能化解决方案落地，善于结合工程实践与前沿技术解决复杂问题。期待在云计算与AI交叉领域持续深耕，创造更大价值。

## 教育背景
| 时间 | 学校 | 专业 | 学历 |
|------|------|------|------|
| 2016-08 ~ 2020-07 | 内蒙古科技大学 | 软件工程 | 本科 |

## 工作经验
| 时间 | 公司名称 | 职位 |
|------|----------|------|
| 2020-08 ~ 2021-12 | 北京科技大学设计研究院有限公司 | 平台开发工程师 |
| 2021-12 ~ 2023-07 | 高创安邦(北京)技术有限公司 | 数据平台开发工程师 |
| 2023-07 ~ 至今 | 北京亚信数据有限公司 | AI平台开发工程师 |

## 项目经验
### 深度学习平台（2023-10 ~ 至今）
#### 项目简介
算力平台为AI开发者及算力运营方构建高效协同的技术生态。平台提供从数据集管理、模型全生命周期管控(开发/训练/推理)到资源调度的一站式服务，支持vLLM/Triton Serve/Onnx等推理框架及DeepSpeed/PyTorch分布式训练任务，内置Llama/DeepSeek/Qwen等开源大模型实现性能优化。创新整合模型市场、镜像市场、算力市场三大资源池，支持Nvidia与沐曦/海光/璧纫等国产算力的统一纳管与智能调度，通过Volcano调度引擎实现异构资源的高效分配，实现算力开发到运营的一体化平台。

#### 技术实现
- 平台侧：基于Golang构建高性能底层服务，深度集成Kubernetes集群；核心模块包括单机/分布式推理服务引擎、Volcano调度引擎、分布式训练框架、统一存储架构、监控与可视化体系。
- 应用侧：基于SpringCloud微服务架构构建平台业务层，覆盖微服务、分布式事务、多租户、支付平台等技术栈。

#### 个人职责
- 负责推理服务核心模块的设计与开发，基于CloneSet完成单机多卡的推理功能开发；
- 实现推理服务的高可用、弹性扩缩容、服务鉴权、灰度发布、算力资源监控、日志、webshell等配套功能；
- 设计并开发基于Ray的分布式推理功能，实现大模型的多机多卡分布式部署；
- 推理模块支持Nvidia及国产显卡上LLama系列、DeepSeek 671B等大模型的分布式部署；
- 基于GPU exporter、node-exporter、cAdvisor、kube-status-metrics实现GPU、Node、Pod、集群资源的监控指标采集。

### 东莞雪亮工程二期-综治应用数据中台（2021-12 ~ 2023-05）
#### 项目简介
综治应用数据中台基于雪亮工程视图数据和各委办局业务数据，构建人、地、事、物等基础资源库及特殊人员、重点事件等专题库，涉及数据采集、存储、仓库构建、元数据管理、共享服务等流程。联合东莞市政务服务数据管理局、中共东莞市委政法委员会打造国产信创产品，整合雪亮工程及委办局数据，构建12类基础库和8大专题库，日均处理超20TB数据，获评广东省数字政府信创优秀案例。

#### 技术实现
基于中标麒麟国产操作系统，采用SpringBoot微服务架构，集成Hadoop、Hive、Spark、DataX等组件；依托Hadoop体系构建PB级数据仓库，结合Spark进行离线、准实时计算分析；通过东方通中间件实现前后端国产化部署，适配达梦/人大金仓国产数据库，形成全栈信创解决方案。

#### 个人职责
- 担任研发经理，全程参与信创国产化适配调研及落地、核心功能设计与评审；
- 负责技术管理及核心代码开发，把控研发规范及进度；
- 联合数据治理人员设计数据流转规范并实施，提升数据入平台效率及数据质量。

### 设备状态实时监测系统（2021-02 ~ 2021-11）
#### 项目简介
工业设备状态实时监测系统支持PLC、传感器等多类型设备接入，集成Modbus/OPC UA等工业协议实现数据采集与预处理。构建实时计算与智能分析平台，实现设备运行状态监控、异常检测及可视化管理，助力企业提升设备运维效率与故障响应能力，满足不同规模工业场景需求。

#### 技术实现
采用“边缘计算 + 业务平台”架构；数据采集支持多协议及研华UNO边缘网关；实时计算基于Flink(RocksDB状态后端)与Drools规则引擎；存储层使用InfluxDB(时序数据)+MySQL(业务数据)；可视化通过Three.js实现数字孪生，结合React+Spring Boot构建前后端分离平台。

#### 个人职责
- 担任核心开发工程师，负责数据采集模块与实时计算引擎设计，实现多协议设备标准化接入与数据清洗逻辑；
- 参与Flink流处理流程优化，提升系统处理效率与稳定性；
- 主导数字孪生可视化模块开发，协助制定技术方案，编写接口规范与开发文档，配合完成系统联调与上线部署。

## 技能特长
1. 熟悉云计算领域IaaS和PaaS层的计算、存储、容器等服务能力及应用场景，可根据业务需求合理选择和使用云服务；
2. 熟悉云原生AI云平台相关开源项目（如Volcano、Vllm、Clonset等），具备云原生环境下AI平台构建和优化能力；
3. 熟悉CNCF社区云原生开源项目（如Kubernetes、Docker、Harbor、Prometheus等），能利用这些工具构建和管理云原生应用；
4. 熟悉大数据组件（如Hadoop、Hive、Azkaban、Sqoop、Datax等），具备数据治理实践经验；
5. 精通JAVA编程语言，熟悉Golang、Python等，具备扎实的Linux脚本编写和操作系统管理能力，可高效处理系统级任务；
6. 熟悉MySQL、KingBase等关系型数据库，能根据应用场景选择合适的数据库解决方案；
7. 熟练掌握软件工程最佳实践，熟练使用禅道、Git、CI/CD等开发工具，通过自动化工具提升开发和运维效率；
8. 熟练掌握中间件技术（如Kafka、Redis、APISIX、Nginx等），能利用这些中间件构建高性能、可扩展的分布式系统。

## 荣誉证书
- 英语四级，听说读写能力良好，能快速浏览英文文档和书籍；
- 通过全国计算机三级考试。